# review

In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

## Series

- 일련의 객체를 담을 수 있는 1차원 배열 같은 자료구조

In [2]:
obj = Series([4,5,-7,3])
obj

0    4
1    5
2   -7
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  5, -7,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [7]:
obj2 = Series([4,7,-5,3],index=['d','b','a','c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [9]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [13]:
obj2['a']

-5

In [15]:
obj2.a

-5

In [16]:
obj2[obj2>0]

d    4
b    7
c    3
dtype: int64

In [17]:
obj2 * 2

d     8
b    14
a   -10
c     6
dtype: int64

In [18]:
np.exp(obj2)

d      54.598150
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [19]:
sdata = {
    'Ohio':35000
    ,'Texas':71000
    ,'Oregon':16000
    ,'Utah':5000
}

In [20]:
obj3 = Series(sdata)
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [21]:
states = ['California','Ohio','Oregon','Texas']

In [22]:
obj4 = Series(sdata, index=states)

In [23]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [25]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [30]:
obj4.name='population'

In [31]:
obj4.index.name = 'state'

In [32]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

## DataFrame

- 데이터를 내부적으로 2차원 형식으로 저장
- 고차원의 표 형식데이터를 나중에 살펴볼 계층적 색인을 통해 쉽게표현

In [34]:
data = {
    'state': ['Ohio','Ohio','Ohio','Nevada','Nevada']
    ,'year': [2000,2001,2002,2001,2002]
    ,'pop':[5,7,3,2,9]
}
frame = DataFrame(data)

In [35]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002],
 'pop': [5, 7, 3, 2, 9]}

In [36]:
frame

    state  year  pop
0    Ohio  2000    5
1    Ohio  2001    7
2    Ohio  2002    3
3  Nevada  2001    2
4  Nevada  2002    9

In [38]:
DataFrame(data,columns = ['year','state','pop'])

   year   state  pop
0  2000    Ohio    5
1  2001    Ohio    7
2  2002    Ohio    3
3  2001  Nevada    2
4  2002  Nevada    9

In [40]:
pop ={
    'Nevada':{2001:2.4,2002:2.9}
    ,'Ohio':{2000:1.5,2001:1.7,2002:3.6}
    
}

In [41]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [42]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [43]:
DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [44]:
pdata = {'Ohio':frame3['Ohio'][:-1]
        ,'Nevada':frame3['Nevada'][:2]
        }
DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [45]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [46]:
frame3.index.name='year';frame3.columns.name='state'

In [48]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [49]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

## 5.3.1 색인객체

- 각 로우와 칼럼에 대한 이름과 다른 메타데이터(축의 이름 등)를 저장하는 객체
- Series나 DataFrame 객체를 생성할 때 사용되는 배열이나 혹은 다른 순차적인 이름은 내부적 색인으로 변환

In [53]:
obj = Series(range(3),index=['a','b','c'])

index = obj.index

index

Index(['a', 'b', 'c'], dtype='object')

In [54]:
index[1:]

Index(['b', 'c'], dtype='object')

In [64]:
index = pd.index(np.arange(3))

obj2 = Series([1,-2,0], index=index)

AttributeError: module 'pandas' has no attribute 'index'

In [63]:
obj2.index is index

False

In [66]:
'Ohio'in frame3.columns

True

### 5.2.1 재색인(reindex)

- 새로운 색이에 맞도록 객체를 새로 생성하는 기능

In [68]:
obj = Series([4,7,-5,3],index=['d','b','a','c'])
obj

d    4
b    7
a   -5
c    3
dtype: int64

이 Series 객체에 대해 reindex를 호출하면 데이터를 새로운 색인에 맞게 재배열하고, 없는 색인 값이 있다면
비어있는 값을 새로 추가

In [71]:
obj2 = obj.reindex(['a','b','c','d','e'])

obj2

a   -5.0
b    7.0
c    3.0
d    4.0
e    NaN
dtype: float64

In [72]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5
b    7
c    3
d    4
e    0
dtype: int64

|인자|설명|
|:-:|:-:|
|ffill|앞의 값으로 채워넣는다.|
|bfill|뒤의 값으로 채워넣는다.|
|fill_value|없는 색인 값이 있다면 비어있는 값을 새로 추가한다.|

In [74]:
obj3 = Series(['blue','purple','yellow']
             ,index=[0,2,4])

In [75]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [76]:
frame = DataFrame(
    np.arange(9).reshape((3,3))
    ,index=['a','c','d']
    ,columns=['Ohio','Texas','California']
)
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [80]:
frame2 = frame.reindex(['a','b','c','d'])

In [81]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [102]:
states=['Texas','Utah','California']
frame.reindex(index=['a','b','c','d']
             ,method='ffill'
             ,columns= states)

ValueError: index must be monotonic increasing or decreasing

In [103]:
frame.reindex(index=['a','b','c','d']
             ,method='ffill')

   Ohio  Texas  California
a     0      1           2
b     0      1           2
c     3      4           5
d     6      7           8

In [104]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

### 5.2.2 하나의 로우 또는 칼럼 삭제하기

```
색인 배열 또는 삭제하려는 로우나 칼럼이 제외된 리스트를 이미 가지고 있다면 로우나 칼럼을 쉽게 삭제할 수 있는데,
이 방법은 데이터의 모양을 변경하는 작업이 필요

drop 메소드를 사용시 선택한 값이 삭제된 새로운 객체를 얻을 수있음
```

In [106]:
obj = Series(np.arange(5.), index=['a','b','c','d','e'])

new_obj = obj.drop('c')

new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [109]:
# 여러개 삭제하고 싶을 때는 팬시색인
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [110]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index=['Ohio','Colorado','Utah','New York']
                ,columns=['one','two','three','four']
                )

In [111]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [112]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [114]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [115]:
data.drop('Ohio')

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

### 5.2.3 색인하기,선택하기,거르기

- Series의 색인(obj[...])은 NumPy 배열의 색인과 유사하게 동작하는데, Series의 색인은 정수가 아니어도 된다.

In [117]:
obj = Series(np.arange(4.),index=['a','b','c','d'])

In [118]:
obj['b']

1.0

In [119]:
obj[1]

1.0

In [120]:
obj[[1,2]]

b    1.0
c    2.0
dtype: float64

In [121]:
obj['b':'c']=5

In [122]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [123]:
data = DataFrame(np.arange(16).reshape((4,4))
                ,index=['Ohio','Colorado','Utah','NewYork']
                ,columns=['one','two','three','four']
                )
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
NewYork    12   13     14    15

In [125]:
data['two']

Ohio         1
Colorado     5
Utah         9
NewYork     13
Name: two, dtype: int32

In [126]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

|형태|의미|
|:-:|:-:|
|iloc|정수|
|loc|문자|
|ix|정수,문자 둘다가능|

In [127]:
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [128]:
data.loc[:'Utah','two']

Ohio        1
Colorado    5
Utah        9
Name: two, dtype: int32

- DataFrame의 값 선택하기

|방식|설명|
|:-:|:-:|
|obj.ix[val] | DataFrame에서 로우의 부분집합을 선택한다.|
|obj.ix[:,val]| DataFrame에서 칼럼의 부분집합을 선택한다.|
|obj.ix[val1,val2]| DataFrame에서 로우와 칼럼의 부분집합을 선택한다.|
|reindex 메서드|하나 이상의 축을 새로운 색인으로 맞춘다.|